app/controllers/customer_controller.rb

  def remove_deposit
    Deposit.destroy(params[:id])
---
DELETE FROM `deposits` WHERE `id` = 6

  def remove_purchase
    Purchase.destroy(params[:id])
---
DELETE FROM `purchases` WHERE `id` = 23