app/controllers/dashboard_controller.rb

  def index
    @products = Product.all(:order => :name)
---
SELECT * FROM `products` ORDER BY name

  def purchase_product
    product = Product.find params[:id]
    @logged_in_user.purchases.create!(:product_id => product.id, :value => product.price)
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
INSERT INTO `purchases` (`updated_at`, `product_id`, `customer_id`, `value`, `created_at`) VALUES('2009-08-22 13:18:45', 5, 1, 50, '2009-08-22 13:18:45')

  def deposit
    @logged_in_user.deposits.create!(:value => (params[:value].to_i))
---
INSERT INTO `deposits` (`updated_at`, `customer_id`, `value`, `created_at`) VALUES('2009-08-22 13:18:11', 1, 0, '2009-08-22 13:18:11')