app/controllers/stocks_controller.rb

SELECT * FROM `stocks`
---
  def index
    @stocks = Stock.all

SELECT * FROM `stocks` WHERE (`stocks`.`id` = 1)
---
  def show
    @stock = Stock.find(params[:id])

SELECT * FROM `products`
---
  def new
    @stock = Stock.new
    @products = Product.all

SELECT * FROM `stocks` WHERE (`stocks`.`id` = 1)
SELECT * FROM `products`
---
  def edit
    @stock = Stock.find(params[:id])
    @products = Product.all

INSERT INTO `stocks` (`updated_at`, `cost`, `product_id`, `quantity`, `created_at`) VALUES('2009-08-22 14:48:50', 3, 6, 4, '2009-08-22 14:48:50')
---
  def create
    @stock = Stock.new(params[:stock])

    respond_to do |format|
      if @stock.save

SELECT * FROM `stocks` WHERE (`stocks`.`id` = 1)
UPDATE `stocks` SET `cost` = 1599, `quantity` = 30, `updated_at` = '2009-08-22 14:50:30' WHERE `id` = 1
---
  def update
    @stock = Stock.find(params[:id])

    respond_to do |format|
      if @stock.update_attributes(params[:stock])